
// 被選定的課程 Root ID 
const SELECTED_COURSE_ROOT_IDS = [
    1, // 理財小學堂
    123, // 小資族 - 存下第一桶金必看
    120, // 懶人投資法 - 被動投資
    50, // 股票基本面
    44, // 股票技術面
    48, // 股票籌碼面
    71, // 經濟指標入門
    64, // 債券小學堂
    45, // 期貨小學堂
    42, // 選擇權小學堂
    53, // 權證小學堂
    46, // 林恩如-簡單投資法
    103, // 艾蜜莉-價值投資法
    10367, // 順流小畢-順勢做交易
    338, // 楊禮軒-領息存股術
    248, // 溫國信-滾出雪球股
    38, // 權證小哥的獨門秘訣
    189, // 無聊詹-盤中警報器
    341, // 丹尼爾-主流股操作法
    10369, // 自由人-交易人生
    174, // 股市阿水-布林通道戰法
    193, // 溫首盛-黃綠紅海撈術
    252, // 喬治林-籌碼必殺技
]

const COURSE_NAME_MAPPING = {
    1: "理財小學堂",
    123: "小資族 - 存下第一桶金必看",
    120: "懶人投資法 - 被動投資",
    50: "股票基本面",
    44: "股票技術面",
    48: "股票籌碼面",
    71: "經濟指標入門",
    64: "債券小學堂",
    45: "期貨小學堂",
    42: "選擇權小學堂",
    53: "權證小學堂",
    46: "林恩如-簡單投資法",
    103: "艾蜜莉-價值投資法",
    10367: "順流小畢-順勢做交易",
    338: "楊禮軒-領息存股術",
    248: "溫國信-滾出雪球股",
    38: "權證小哥的獨門秘訣",
    189: "無聊詹-盤中警報器",
    341: "丹尼爾-主流股操作法",
    10369: "自由人-交易人生",
    174: "股市阿水-布林通道戰法",
    193: "溫首盛-黃綠紅海撈術",
    252: "喬治林-籌碼必殺技",
}

module.exports = {
    SELECTED_COURSE_ROOT_IDS,
    COURSE_NAME_MAPPING
}